Revit 2027 API
DWFExportOptions.ImageFormat Property
Controls the compression level of images embedded.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public DWFImageFormat ImageFormat { get; set; }
Public Property ImageFormat As DWFImageFormat
	Get
	Set
public:
property DWFImageFormat ImageFormat {
	DWFImageFormat get ();
	void set (DWFImageFormat value);
}
member ImageFormat : DWFImageFormat with get, set
Property Value
DWFImageFormat
Remarks
ImageQuality is ignored when ImageFormat is set to "PNG"-the standard format.
See Also
Reference
DWFExportOptions Class
Autodesk.Revit.DB Namespace